
#лучше эти данные хранить в самих тестах, а не выносить в отдельный файл.
#Если бы эти данные использовались несколько раз, тогда имело смысл их хранить отдельно от тестов.

#А зачем тогда в подсказках сказано "Тела POST-запросов вынеси в отдельный файл data.py."?
# вижу разночтения здесь
#Сейчас получается так, что мне вообще не нужен файл data. - все данные я использую в других местах.
# Вообще не понимаю ничего.

#нужно написать функцию, которая будет менять содержимое тела запроса (get_kit_body) и использовать ее в тестах.

#А в задании сказано, что МОЖНО написать функцию get_kit_body
# то есть, можно писать, можно не писать.
#я отказался от её написания, так как не совсем понимаю логику использования данной функции
#эээ
#ну я конечно попробую, но мне пока оч понятно моё решение и вообще непонятна, зачем вводить другую функцию

# хм, я наверное понял, зачем заводим отдельную функцию под это дело, меньше писанины, да
# но понять это довольно тяжело.

# И теперь у меня вообще пустой этот файл
# скорее всего, я неправильно понял первую часть исправлений, про функцию создания пользователя и запроса.